Repository: Hamdy/flutter-scaffold
Catalog: lib/l10n/app_*.arb
Languages: ar

# connectionErr
source: Can not connect to Server
ar: لا يمكن الاتصال بخادم البيانات

# prepareForChallengeHeader
source: Prepare for the Challenge
ar: استعد للتحدي

# prepareForChallengeBody
source: Discover a unique experience with our fitness app and collaborate with professional trainers to achieve your fitness goals.
ar: اكتشف تجربة فريدة مع تطبيقنا الرياضي وتعاون مع مدربين محترفين لتحقيق أهدافك الرياضية.

source: Next
ar: التالي

# expertTrainersHeader
source: Expert Trainers
ar: المدربون الخبراء

# expertTrainersBody
source: Meet our professional trainers who will guide you to achieve your full athletic potential and help you overcome challenges.
ar: تعرف على مدربينا المحترفين الذين سوف يوجهونك نحو تحقيق اقصى الإمكانيات الرياضيه ويساعدونك فى تجاوز التحديات

# joinAndShineHeader
source: Join and Shine
ar: انضم وتألق

# joinAndShineBody
source: Join our app today and get the chance for personal training and motivation to build a successful fitness lifestyle.
ar: انضم إلى تطبيقنا اليوم واحصل على فرصة التدريب الشخصى والتحفيز لبناء نمط حياة رياضى ناجح

# welcomeHeader
source: Welcome to Fit Zone
ar: أهلا بك فى فيت زون

# welcomeBody
source: Discover a new world of entertainment with an app that fundamentally combines challenges and fun.
ar: اكتشف عالما جديدا من الترفيه مع تطبيق يجمع بين التحديات والمتعة بشكل أساسى

# agreeTo
source: I agree to
ar: أوافق على

# policy
source: Privacy Policy
ar: سياسة الخصوصية

source: of the app
ar: الخاصة بالتطبيق

source: Sign Up
ar: إنشاء حساب

# createAccount
source: Create Your Account
ar: إنشاء حسابك

source: Login
ar: تسجيل الدخول

# continueNext
source: Continue
ar: متابعة

# fillInSignupForm
source: Please enter the following details to create your account
ar: يرجى إدخال البيانات التالية لإنشاء حسابك

source: Enter Your Name
ar: أدخل اسمك

# enterYourEmail
source: Enter Your Email Address
ar: أدخل بريدك الإلكتروني

source: Enter Your Phone Number
ar: أدخل رقم هاتفك

# alreadyHaveAccoount
source: Already have an account?
ar: هل لديك حساب بالفعل؟

# verifyYourAccoount
source: Verify Your Account
ar: تأكيد حسابك

# enterCode
source: Please enter the code sent to your number
ar: يرجى إدخال الرمز المرسل إلى رقمك

# emailAddressInvalid
source: The email address is invalid
ar: البريد الإلكتروني غير صحيح

source: Enter at least three characters
ar: أدخل ثلاثة أحرف على الأقل

# phoneNumberInvalid
source: The phone number is invalid
ar: رقم الهاتف غير صحيح

# nameRequired
source: Enter Your Name
ar: ادخل اسمك

# emailRequired
source: Enter Your Email Address
ar: ادخل بريدك الإلكترونى

# phoneRequired
source: Enter Your Phone Number
ar: أدخل رقم هاتفك

source: Privacy Policy
ar: سياسة الخصوصية

source: Resend Code
ar: إعادة إرسال الرمز

# emailAlreadyRegistered
source: Email address already registered
ar: البريد الإلكترونى مسجل مسبقا

source: Phone already registered
ar: رقم الهاتف مسجل مسبقا

# phoneNotRegistered
source: Phone number is not registered
ar: رقم الهاتف غير مسجل

# accountConfirmation
source: Confirm Your Account
ar: تأكيد حسابك

# enterOTP
source: Enter OTP number sent to phone
ar: الرجاء إدخال الرمز الذى تم إرساله لرقم

source: Unknown Error
ar: خطأ غير معلوم

source: Tell us more about you
ar: أخبرنا بالمزيد عنك

source: Join us
ar: إنضم إلينا

# recordYourData
source: Record your data to measure weight and height, and improve your fitness progress
ar: سجّل بياناتك لقياس الوزن والطول وتحسين تقدمك الرياضي

# joinAsTrainee
source: Join as a trainee
ar: أنضم كمُتدرب/ة

# searchForDieitian
source: Search for a nutrition expert to help you develop a healthy diet
ar: ابحث عن خبير تغذية لمساعدتك في تطوير نظام غذائي صحي

# joinAsCoach
source: Join as a coach
ar: أنضم كمٌدرب/ة

# findAcoach
source: Search for a nutrition expert to help you develop a healthy diet
ar: ابحث عن خبير تغذية لمساعدتك في تطوير نظام غذائي صحي

# chooseYourPlan
source: Choose the plan that suits you
ar: اختر النظام الذى تفضله

# chooseAPlanThatFitsYou
source: Record your data to measure weight and height and improve your fitness progress
ar: اختر الخطة التي تناسبك

source: Diet Plan
ar: نظام غذائي

# findAdietitian
source: Find a dietitian to help you develop a healthy nutrition plan
ar: ابحث عن خبير تغذية لمساعدتك في تطوير خطة غذائية صحية

source: Fitness Plan
ar: لياقة بدنية

# findAfitnessTrainer
source: Find a fitness trainer to help you develop a healthy fitness plan
ar: ابحث عن مدرب لياقة بدنية لمساعدتك في تطوير خطة رياضية

source: Comprehensive Plan
ar: نظام متكامل

# findAComprehensivePlanTrainer
source: Find a trainer to help you with a comprehensive plan
ar: ابحث عن مدرب يساعدك في إعداد خطة متكاملة

# chooseCoachGender
source: Choose the coach''s gender?
ar: أختار نوع المدرب ؟

# enterYourCoachGenderPreferences
source: Enter your preferences to improve your fitness progress
ar: سجّل بياناتك لقياس الوزن والطول وتحسين تقدمك الرياضي

source: Female
ar: أنثى

source: Male
ar: ذكر

# bothGenders
source: Either
ar: ايا كان

source: Your personal info
ar: بياناتك الشخصية

# enterYourPersonalInfo
source: Please Enter your personal info to help us track your progress
ar: سجّل بياناتك لقياس الوزن والطول وتحسين تقدمك الرياضي

# height
source: Height (cm)
ar: الطول ( سم )

# weight
source: Weight (kg)
ar: الوزن ( كج )

# idealWeight
source: Ideal Weight (kg)
ar: الوزن المثالى ( كج )

source: Gender
ar: النوع

source: Birth Date
ar: تاريخ الميلاد

source: cm
ar: سم

source: kg
ar: كج

source: Enter birth date
ar: أدخل تاريخ الميلاد

source: Enter height
ar: أدخل الطول

source: Enter weight
ar: أدخل الوزن

source: Enter ideal weight
ar: أدخل الوزن المثالى

source: Your experience and bio
ar: خبراتك ومعلوماتك

source: Enter your experience
ar: أدخل خبراتك

# pleaseProvideUsWithABrief
source: Please provide us with a brief about your weight and height for improvement
ar: سجّل بياناتك لقياس الوزن والطول وتحسين

source: Bio
ar: نبذة عنك

# briefBioAboutYou
source: Enter a brief bio about yourself
ar: أدخل نبذة عنك بأختصار

# fields
source: Fields of specialization
ar: التخصصات

# dietitianPlan
source: diet plan
ar: تغذية

source: Both options
ar: الخيارات معًا

source: Certificates
ar: الشهادات الحاصل عليها

source: Languages spoken
ar: اللغات المُجادة

# spanishLanguage
source: Spanish
ar: الاسبانية

# arabicLanguage
source: Arabic
ar: العربية

# englishLanguage
source: English
ar: الإنجليزية

source: Number of years of experience
ar: عدد سنين الخبرة

source: Enter Number of years of experience
ar: أدخل عدد سنين الخبرة

source: Your personal information
ar: معلوماتك

# enterYourPersonalInformation
source: Enter your personal information to measure weight and height for improvement
ar: سجّل بياناتك لقياس الوزن والطول وتحسين

source: Upload ID
ar: رفع الهوية

# limit10Mbs
source: File size should not exceed 10 MB (JPG or PNG)
ar: ولا يزيد حجم الملف عن 10 ميغابايت JPG أو PNG

source: Upload personal image
ar: رفع الصورة الشخصية

# uploadCoverImage
source: Upload cover photo
ar: رفع صورة الغلاف

# bankingInfo
source: Banking information
ar: معلوماتك البنكية

# enterBankingInfoBody
source: Enter your banking details for improvement
ar: سجّل بياناتك البنكية لتحسين

# iban
source: IBAN number
ar: رقم IBAN البنكي

source: Name
ar: الاسم

# bankRegisteredName
source: Personal name
ar: الاسم الشخصى

source: Bank name
ar: اسم البنك

source: Bank country
ar: الدولة

source: Bank city
ar: المدينة

# schedule
source: Work schedule
ar: مواعيد العمل

source: Enter your holidays
ar: أدخل اجازاتك

source: Matched trainees
ar: متطابق مع المتدربين

source: Full program
ar: نظام متكامل

source: Months
ar: شهور

source: Year
ar: سنة

source: Daily activities
ar: الأنشطة اليومية

source: Program
ar: برنامج

source: The diet
ar: النظام الغذائي

source: Achievements brief
ar: ملخص إنجازاتك

source: All
ar: الكل

source: Completed
ar: مكتمل

source: Non-completed
ar: غير مكتمل

source: Trainees
ar: المتدربون

source: New requests
ar: طلبات جديدة

source: Month
ar: شهر

source: Add new certificate
ar: أضف شهادة جديدة

source: Enter certificate name
ar: أدخل اسم الشهادة

source: Upload certificate
ar: أرفع الشهادة

source: Trainee details
ar: تفاصيل المتدرب

source: Accept
ar: قبول

source: Reject
ar: رفض

source: Chat with trainee
ar: تواصل مع المتدرب

source: Trainee subscription start date
ar: موعد بداية الاشتراك

source: Trainee subscription end date
ar: موعد الانتهاء

source: Personal profile
ar: الملف الشخصي

source: Personal information
ar: بياناتك الشخصية

source: Personal experiences
ar: خبراتك الشخصية

source: Wallet
ar: المحفظة

source: Latest transactions
ar: معاملاتك الأخيرة

source: Session management
ar: إدارة الجلسات والمواعيد

# inviteYourFriend
source: Invite your friends
ar: قم بدعوة أصدقائك

# getAdiscountOnReferreingFriends
source: Get a 20 AED voucher when they subscribe
ar: واحصل على قسيمة بقيمة 20 درهم عند اشتراكهم

source: Participate and win
ar: شارك وأحصل

# sponsoredCoaches
source: Featured Coaches
ar: مدربون مميزون

# displayMore
source: Show more
ar: عرض المزيد

source: Coaches
ar: المدربين

# fitnessAndNutrion
source: fitness and nutrition
ar: لياقة وتغذية

source: Your subscription
ar: اشتراكك

# shareWithFriends
source: Share with your friends
ar: شارك مع أصدقائك

# profile
source: Personal profile
ar: الملف الشخصى

# paymentMethods
source: Payment method
ar: طريقة الدفع

source: Change payment method
ar: تغيير طريقة الدفع

source: Add new
ar: إضافة جديد

# back
source: Go back
ar: العودة

source: Back Home
ar: العودة للرئيسية

source: Logout
ar: الخروج

source: Settings
ar: الإعدادات

source: Achieved Goals
ar: الأهداف المحققة

# totalTime
source: Total Time (s)
ar: الزقت الإجمالى (س)

source: Notifications
ar: الإشعارات

# fitnessStatus
source: Your Fitness Status
ar: حالتك البدنية

source: Language
ar: اللغة

source: Support
ar: المساعدة والدعم

source: Choose Language
ar: اختار اللغة

# changeprofilepicture
source: Change Picture
ar: تغيير الصورة

source: Full name
ar: الاسم بالكامل

source: Email Address
ar: البريد الالكترونى

source: Phone number
ar: رقم التليفون

source: Confirm changes
ar: تأكيد التعديلات

source: delete
ar: حذف

# noCardsAvailable
source: No registered credit cards
ar: لا يوجد بطاقات ائتمان مسجلة

source: Find a coach ...
ar: ابحث عن مدرب ....

source: Filter coaches
ar: تصفية المدربين

source: Reset
ar: إعادة تعيين

# mainCategorization
source: Main Filters
ar: تصنيف رئيسي

# ratingCategorization
source: Rating filters
ar: حسب التقييم

source: Filter
ar: فلترة

source: Your Goals
ar: أخبرنا عن اهدافك

# tellUsAboutYourFitnessGoals
source: Enter your fitness Goals
ar: ماهى اهدافك من ناحية اللياقة

source: Lose Weight
ar: فقدان الوزن

source: Muscle Building
ar: بناء العضلات

source: Increase Elasticity
ar: زيادة المرونة

source: Learn Basics
ar: تعلم الأساسيات

source: Maintain Fitness
ar: الحفاظ علي اللياقة

source: Beginner
ar: مبتدئ

source: Intermediate
ar: متوسط

source: Advanced
ar: متقدم

source: Improve General Diet
ar: تحسين التغذية العامة

# limitWeight
source: Set Target Weight
ar: تحديد مستهدف للوزن

# balanceCarbProteinFats
source: Balance Protein, Carbs, and Fats
ar: توازن البروتين والكربوهيدرات والدهون

# tellUsAboutYourFavoriteFoods
source: Your Favorite Foods
ar: الاطعمة المفضلة لديك

# enterYourFavoriteFoods
source: Enter the following details to create your account!
ar: أدخل البيانات التالية لأنشاء حسابك!

# doYouHaveAlergies
source: Do You Have Any Allergies
ar: هل تعانى من اى حساسية

# enterYouAllergies
source: Enter the following details to create your account!
ar: أدخل البيانات التالية لأنشاء حسابك!

source: Number of Your Meals
ar: عدد وجباتك

# enterNumberOfyourMeals
source: Enter the following details to create your account!
ar: أدخل البيانات التالية لأنشاء حسابك!

source: Tell us about your level
ar: أخبرنا عن مستواك

# enterYourLevel
source: Enter the following details to create your account
ar: أدخل البيانات التالية لإنشاء حسابك

# tellUsAboutYourTools
source: Tools that assist you
ar: الادوات التي تساعدك

# enterYourTools
source: Enter the following details to create your account
ar: أدخل البيانات التالية لإنشاء حسابك

# tellUsAboutTrainingPlace
source: Your training place
ar: مكان تدريبك

# enterYourTrainingPlace
source: Enter the following details to create your account
ar: أدخل البيانات التالية لإنشاء حسابك

source: Gym
ar: صالة الألعاب الرياضية

# gymDescription
source: For muscle strengthening and power development exercises.
ar: لتمارين تقوية العضلات وتطوير القوة.

source: Home
ar: المنزل

# homeDescription
source: For muscle strengthening and power development exercises.
ar: لتمارين تقوية العضلات وتطوير القوة.

# backyard
source: Backyard or playground
ar: الملعب او الحديقة

# backyardDescription
source: For muscle strengthening and power development exercises.
ar: لتمارين تقوية العضلات وتطوير القوة.

# rob
source: Jump rope
ar: الحبل القفاز

# robDescription
source: For muscle strengthening and power development exercises.
ar: لتمارين تقوية العضلات وتطوير القوة.

# ball
source: Fitness ball
ar: الكرة اللياقة

# ballDescription
source: For muscle strengthening and power development exercises.
ar: لتمارين تقوية العضلات وتطوير القوة.

# traininePlace
source: Your training place
ar: مكان تدريبك

# traininePlaceDescription
source: Enter the following details to create your account!
ar: أدخل البيانات التالية لأنشاء حسابك!

# dumbels
source: Dumbbells
ar: الدمبل

# dumbelsDescription
source: For muscle strengthening and power development exercises.
ar: لتمارين تقوية العضلات وتطوير القوة.

source: professional
ar: محترف

source: Fish
ar: سمك

source: Eggs
ar: بيض

source: Beans
ar: بقوليات

source: Oats
ar: شوفان

source: Potatoes
ar: بطاطس

source: Rice
ar: أرز

source: Meat
ar: لحوم

source: Milk
ar: لبن

source: Juice
ar: عصائر

source: Fruits
ar: فواكه

source: Salad
ar: سلطات

source: Chicken
ar: دجاج

source: Meal
ar: وجبة

source: Start Date
ar: تاريخ البدء

source: Total Cost
ar: التكلفة الاجمالية

source: Add New Card
ar: اضافة بطاقة جديدة

source: Card Details
ar: تفاصيل البطاقة

source: Card Holder Name
ar: اسم صاحب البطاقة

source: Card Number
ar: رقم البطاقة

# cardExpiryDate
source: Expiry Date
ar: تاريخ الانتهاء

# cardCCV
source: CVV
ar: الرمز السري

# agreeToSaveCardDetailsForFutureUse
source: I agree to save card details for future use
ar: أوافق على حفط بيانات البطاقة لإعادة استخدامها

source: Try again
ar: حاول مرة أخرى

source: Subscription failed!
ar: الإشتراك فشل

# retryToSubscribe
source: Sorry, the subscription process could not be completed. Please try again.
ar: عذرًا، لم يتمكن من اتمام عملية الاشتراك. يرجى المحاولة مرة أخرى.

# cardAddFailed
source: Card addition failed
ar: فشل إضافة البطاقة

# retryToAddCard
source: Sorry, the card could not be added. Please try again.
ar: عذرًا، لم يتمكن من اتمام إضافة البطاقة. يرجى المحاولة مرة أخرى.

# coachProvidesThesePlans
source: The coach offers the following services
ar: المدرب يقدم الخدمات التالية

# chooseCoachServie
source: Choose from the coach''s services for your needs
ar: اختر من خدمات المدرب لاحتياجك

# subscriptionStartDate
source: Start date
ar: تحديد موعد البدء

# subscribeWithCoachHeader
source: Subscribe with the Coach
ar: أشترك مع المدرب

# subscribeWithCoachBody
source: Benefit from a unique experience with your monthly subscription, where you will receive a monthly one-on-one session to adjust your goals.
ar: استفد من تجربة فريدة مع اشتراكك الشهري، حيث ستتلقى جلسة فردية شهرية لضبط أهدافك،

# three_months
source: 3 months
ar: ٣ شهور

# six_months
source: 6 months
ar: ٦ شهور

# one_year
source: yearly
ar: سنوى

# threeMonthsPlanDescription
source: Provides you with a monthly one-on-one session, personal workout plan, and email support
ar: يتيح لك جلسة فردية شهرية، برنامج تمرين شخصي، ودعم عبر البريد الإلكتروني

# sixMonthsPlanDescription
source: Provides you with a monthly one-on-one session, personal workout plan, and email support
ar: يتيح لك جلسة فردية شهرية، برنامج تمرين شخصي، ودعم عبر البريد الإلكتروني

# oneYearPlanDescription
source: Provides you with a monthly one-on-one session, personal workout plan, and email support
ar: يتيح لك جلسة فردية شهرية، برنامج تمرين شخصي، ودعم عبر البريد الإلكتروني

source: SAR
ar: ريال

source: USD
ar: دولار

source: EUR
ar: يورو

source: EGP
ar: جنيه

source: Payment details
ar: تفاصيل الدفع

source: Request details
ar: تفاصيل الطلب

source: change
ar: تغيير

source: Rating
ar: تقييم

source: The Ratings
ar: التقييمات

source: Ratings
ar: تقييمات

source: Fitness
ar: لياقة بدنية

# nutrionist
source: Nutritionist
ar: تغذية

source: Read More
ar: اقرأ المزيد

source: Read Less
ar: اخفاء

source: Be One of the Family
ar: كن واحدا من العائلة

source: Other Achievements
ar: إنجازات أخرى

source: Years of Experience
ar: سنوات خبرة

source: Comments
ar: تعليقات

source: Comment
ar: تعليق

source: Star
ar: نجمة

source: Stars
ar: نجوم

source: Subscribe now
ar: اشترك الآن

source: Training period
ar: فترة التدريب

# fiveStars
source: 5 stars
ar: 5 نجوم

# fourStars
source: 4 stars
ar: 4 نجوم

# threeStars
source: 3 stars
ar: 3 نجوم

# twoStars
source: 2 stars
ar: 2 نجوم

# oneStars
source: 1 star
ar: 1 نجوم

# years
source: سنة
ar: سنوات

# noCoachesAvailabileCurrently
source: No active coaches currently
ar: لا يوجد مدربون نشطاء حاليا

# fitnessCoach
source: Fitness
ar: مدرب لياقة بدنية

source: Nutritionist
ar: مدرب تغذية

# fitnessAndNutritionistCoach
source: Fitness & Nutritionist
ar: مدرب لياقة وتغذية

source: Welcome
ar: مرحبا

source: We are excited to see you
ar: نحن متحمسون لرؤيتك

source: Your program
ar: برنامجك

# yourProgramIsYourCompanion
source: Your daily companion for health and activity
ar: رفيق يومي للصحة والنشاط

source: Exercises
ar: التمارين

source: Exercise
ar: تمرين

source: Complete
ar: استكمل

source: Your diet
ar: نظامك الغذائي

# mealsDuringTheDay
source: Meals throughout the day
ar: وجبات علي مدار اليوم

# chatWithCoachAndStatyUptodate
source: Chat with your coach and stay updated
ar: تحدث مع مدربك وتابع التطورات

source: Your plan management
ar: إدارة خطتك

# trainingPlan
source: Training package
ar: باقة تدريب

# endsAtJanuary
source: Ends in January
ar: تنتهى فى يناير

# startsAtFebruary
source: Starts in February
ar: تبدأ فى فبراير

# endsAtFebruary
source: Ends in February
ar: تنتهى فى فبراير

# startsAtMarch
source: Starts in March
ar: تبدأ فى مارس

# endsAtMarch
source: Ends in March
ar: تنتهى فى مارس

# startsAtApril
source: Starts in April
ar: تبدأ فى أبريل

# endsAtApril
source: Ends in April
ar: تنتهى فى أبريل

# startsAtMay
source: Starts in May
ar: تبدأ فى مايو

# endsAtMay
source: Ends in May
ar: تنتهى فى مايو

# startsAtJune
source: Starts in June
ar: تبدأ فى يونيو

# endsAtJune
source: Ends in June
ar: تنتهى فى يونيو

# startsAtJuly
source: Starts in July
ar: تبدأ فى يوليو

# endsAtJuly
source: Ends in July
ar: تنتهى فى يوليو

# startsAtAugust
source: Starts in August
ar: تبدأ فى اغسطس

# endsAtAugust
source: Ends in August
ar: تنتهى فى اغسطس

# startsAtSeptember
source: Starts in September
ar: تبدأ فى سيتمبر

# endsAtSeptember
source: Ends in September
ar: تنتهى فى سبتمبر

# startsAtOctober
source: Starts in October
ar: تبدأ فى اكتوبر

# endsAtOctober
source: Ends in October
ar: تنتهى فى اكتوبر

# startsAtNovember
source: Starts in November
ar: تبدأ فى نوفمبر

# endsAtNovember
source: Ends in November
ar: تنتهى فى نوفمبر

# startsAtDecember
source: Starts in December
ar: تبدأ فى ديسمبر

# endsAtDecember
source: Ends in December
ar: تنتهى فى ديسمبر

source: Move to yearly plan
ar: الانتقال للباقة السنوية

source: Renew subscription
ar: تجديد الإشتراك

source: Cancel subscription
ar: إلغاء الإشتراك

# rateCoach
source: Rate the coach
ar: تقييم المدرب

source: Later
ar: لاحقا

source: Add weight and photo
ar: أضف صورة ووزن

# addYourCurrentWeight
source: Enter your current weight
ar: ادخل وزنك الحالى

source: Add
ar: إضافة

source: Upload photo
ar: ارفع الصورة

# yourProgressBrifing
source: Your progress briefing
ar: موجز تقدمك

# quarterlyYear
source: Quarter yearly package
ar: باقة ربع سنوية

# halflyYear
source: Half yearly package
ar: باقة نصف سنوية

# yearly
source: Yearly package
ar: باقة سنوية

# yourExcercises
source: Exercises
ar: التمارين

# carb
source: Carbs
ar: نشويات

source: Fats
ar: دهون

source: Protein
ar: بروتين

# yourMeal
source: Meal
ar: الوجبة

source: Recipe
ar: طريقة التحضير

# finishMeal
source: End meal
ar: إنهاء الوجبة

# moreExcerciese
source: More exercises
ar: المزيد من التمارين

# gram
source: gm
ar: ج

source: minutes
ar: دقائق

source: Dark mode
ar: نظام مظلم

source: LightMode
ar: نظام مضئ
